package com.summary.day;
/*	标识符  	变量与常量	 数据类型	表达式与运算符
	一、标识符
	1、概念
		标记 识别的符号
	2、作用
	命名， 给类、方法、变量、常量命名。
	3、命名规则
		语法强制要求，不遵循编译错误。
		数字 下划线 英文字母 $
		不能以数字开头
		不能用java关键字和保留字
	4、命名规范
		约定俗成
		见名知意 
		类名字 首字母大写
		方法名字 首字母小写 第二个单词的首字母大写
		常亮 所有字母大写
	
	二、数据类型
	
	基本类型	数值型 	byte(1) short(2) int(4) long(8) 整数型
					float(4) double(8) 		浮点型
		 	字符型	char(2字节16位)
		 	布尔型	boolean(1位)(8位=1字节)
	引用类型  最常见的String
	//=========================================
	unicode 编码
		'a'=97
		'A'=65
		'0'=48 '9'=57
	//========================================
	转义字符
	\b 退格	\n换行	\r回车	 \t 制表符（tab）
	
	三 运算符
	
	
		
 * 
 * 
 * */



public class D002biaozhifu {

}
