package com.summary.day;
/*OOP
 * 1、概念
 * objerct oriented programming
 * 面向对象编程
 * 
 * 一、面向对象
 * 二、类
 * 三、对象 object
 * 	一切都是值的传递  如地址；
 * 	必须存在空间|对象才能调用，否则NullPointerException,
	原因:只有引用没有对象
 * 	每个对象都拥有自己存储空间，对象之间空间独立。
 * 
 * 四、内存分析
 * 	1)、栈(stack): 方法栈，存储局部变量、形参 如基本类型、引用. 特点:后进先出,线性结构。
	2)、堆(heap): 对象的堆，存储new对象，不可共享。
	3)、方法区|静态区|常量池(method area |static area): 特殊的对，共享信息。
	引用特点
	1)、一切皆为值传递，没有引用传递。
	2)、一个对象存在多个引用，当其中一个引用对其发生变化，另外的引用也可见。
	3)、一个引用在一个时刻只能指向一个对象。
	
	五、构造器(构造方法)
	  	确保空构造存在；
	 	构造器重载
	

 * 
 * 
 * */
public class D005OOP {

}
